Revit 2026 API

# ExternallyTaggedBRep Methods

---

The ExternallyTaggedBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ExternallyTaggedGeometryObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTaggedGeometry | Returns the externally tagged geometry object. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternallyTaggedBRep Class

Autodesk.Revit.DB Namespace